julioosinski/toplavanderia/releases/ESP32_Poltrona_v1.3.7.ino
/** HTTPS com timeout de conexão — evita o travamento eterno que deixava o ESP "offline". */
bool httpsBegin(HTTPClient& http, WiFiClientSecure& client, const String& url) {
  wdtKick();
  client.setInsecure();
  client.setTimeout(HTTP_CONNECT_TIMEOUT_MS / 1000);
  http.setConnectTimeout(HTTP_CONNECT_TIMEOUT_MS);
  http.setTimeout(HTTP_TIMEOUT_MS);
  http.setReuse(false);
  return http.begin(client, url);
}

bool sendHeartbeat() {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClientSecure client;
  HTTPClient http;
  String url = String(supabaseUrl) + "/functions/v1/esp32-monitor?action=heartbeat";
  if (!httpsBegin(http, client, url)) {
    noteNetFail();
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseApiKey);
  http.addHeader("Authorization", String("Bearer ") + supabaseApiKey);

  StaticJsonDocument<768> doc;
  doc["esp32_id"] = ESP32_ID;
  doc["laundry_id"] = LAUNDRY_ID;
  doc["device_name"] = MACHINE_NAME;
  doc["firmware_version"] = FIRMWARE_VERSION;
  doc["ip_address"] = WiFi.localIP().toString();
  doc["signal_strength"] = WiFi.RSSI();
  doc["network_status"] = String("connected|rst:") + lastResetReason;
  doc["auto_register"] = true;
  doc["uptime_seconds"] = millis() / 1000UL;
  doc["session_status"] = statusAtual;
  doc["session_remaining_sec"] = tempoRestanteSeg;
  doc["device_profile"] = "timed_session";
  doc["cooling"] = (coolPhase != COOL_IDLE);
  JsonObject relay = doc.createNestedObject("relay_status");
  relay["relay_1"] = relayShouldBeOn() ? "on" : "off";

  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  http.end();
  client.stop();
  wdtKick();

  if (code == 200) {
    noteNetOk();
    return true;
  }
  noteNetFail();
  return false;
}

bool confirmCommand(const char* commandId) {
  if (!commandId || strlen(commandId) == 0) return false;
  if (WiFi.status() != WL_CONNECTED) return false;

  wdtKick();
  WiFiClientSecure client;
  HTTPClient http;
  String url = String(supabaseUrl) + "/functions/v1/esp32-monitor?action=confirm_command";
  if (!httpsBegin(http, client, url)) {
    noteNetFail();
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseApiKey);
  http.addHeader("Authorization", String("Bearer ") + supabaseApiKey);

  StaticJsonDocument<256> doc;
  doc["command_id"] = commandId;
  doc["esp32_id"] = ESP32_ID;
  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  http.end();
  client.stop();
  wdtKick();
  Serial.printf("confirm %s → %d\n", commandId, code);
  if (code == 200) noteNetOk();
  else noteNetFail();
  return code == 200;
}

int parseCycleMinutes(JsonObject cmd) {
  int minutes = 0;
  if (cmd["cycle_time_minutes"].is<int>()) minutes = cmd["cycle_time_minutes"].as<int>();
  else if (cmd["cycle_time_minutes"].is<float>()) minutes = (int)cmd["cycle_time_minutes"].as<float>();
  else if (cmd["cycle_time_minutes"].is<const char*>()) minutes = atoi(cmd["cycle_time_minutes"].as<const char*>());

  if (minutes <= 0 && cmd.containsKey("payload")) {
    JsonObject payload = cmd["payload"];
    if (!payload.isNull()) {
      if (payload["cycle_time_minutes"].is<int>()) minutes = payload["cycle_time_minutes"].as<int>();
      else if (payload["cycle_time_minutes"].is<float>()) minutes = (int)payload["cycle_time_minutes"].as<float>();
      else if (payload["cycle_time_minutes"].is<const char*>()) minutes = atoi(payload["cycle_time_minutes"].as<const char*>());
    }
  }
  if (minutes <= 0) minutes = DEFAULT_CYCLE_MINUTES;
  if (minutes > 24 * 60) minutes = 24 * 60;
  return minutes;
}

void aplicarVolumeSeValido(JsonObject src, const char* key, int* target) {
  if (!src.containsKey(key) || !target) return;
  int value = src[key] | *target;
  if (value < 0) value = 0;
  if (value > 30) value = 30;
  *target = value;
}

void applyRuntimeAudioConfig(JsonObject cmd) {
  if (!cmd.containsKey("payload")) return;
  JsonObject payload = cmd["payload"];
  if (payload.isNull()) return;
  JsonObject nested = payload["audio_volumes"];
  JsonObject source = nested.isNull() ? payload : nested;
  aplicarVolumeSeValido(source, "volume_audio_001", &volume_audio_001);
  aplicarVolumeSeValido(source, "volume_audio_002", &volume_audio_002);
  aplicarVolumeSeValido(source, "volume_audio_003", &volume_audio_003);
  aplicarVolumeSeValido(source, "volume_audio_004", &volume_audio_004);
  aplicarVolumeSeValido(source, "volume_audio_005", &volume_audio_005);
  aplicarVolumeSeValido(source, "volume_audio_006", &volume_audio_006);
  aplicarVolumeSeValido(source, "volume_audio_007", &volume_audio_007);
}

void processCommand(JsonObject cmd) {
  const char* action = cmd["action"] | "";
  const char* cmdId = cmd["id"] | "";
  if (strlen(cmdId) == 0) return;

  if (lastExecutedCommandId == cmdId) {
    if ((strcmp(action, "on") == 0 || strcmp(action, "activate") == 0 || strcmp(action, "turn_on") == 0)
        && statusAtual != "em_uso") {
      Serial.println("♻️ ON reentregue sem sessão ativa — tenta ligar de novo");
    } else {
      confirmCommand(cmdId);
      return;
    }
  }

  if (strcmp(action, "on") == 0 || strcmp(action, "activate") == 0 || strcmp(action, "turn_on") == 0) {
    applyRuntimeAudioConfig(cmd);
    if (!iniciarPoltrona(parseCycleMinutes(cmd))) return;
    if (confirmCommand(cmdId)) {
      markCommandExecuted(cmdId);
    }
    sendHeartbeat();
    lastHeartbeat = millis();
    reassertRelayIfSession();
  } else if (strcmp(action, "off") == 0 || strcmp(action, "deactivate") == 0 || strcmp(action, "turn_off") == 0) {
    bool forceOff = false;
    if (cmd.containsKey("payload")) {
      JsonObject payload = cmd["payload"];
      if (!payload.isNull()) {
        forceOff = payload["force"] | false;
        if (!forceOff) forceOff = payload["remote_stop"] | false;
        if (!forceOff) forceOff = payload["admin_stop"] | false;
      }
    }
    if (statusAtual == "em_uso" && !forceOff) {
      markCommandExecuted(cmdId);
      confirmCommand(cmdId);
      reassertRelayIfSession();
      return;
    }
    markCommandExecuted(cmdId);
    // Parar manual também faz o resfriamento de 30s (não bloqueia a rede).
    pararPoltrona(true);
    confirmCommand(cmdId);
    sendHeartbeat();
    lastHeartbeat = millis();
  }
}

