julioosinski/toplavanderia/releases/ESP32_Poltrona_v1.3.7.ino
void pollCommands() {
  if (WiFi.status() != WL_CONNECTED) return;

  wdtKick();
  WiFiClientSecure client;
  HTTPClient http;
  String url = String(supabaseUrl) + "/functions/v1/esp32-monitor?action=poll_commands&esp32_id=" + ESP32_ID;
  if (!httpsBegin(http, client, url)) {
    noteNetFail();
    return;
  }
  http.addHeader("apikey", supabaseApiKey);
  http.addHeader("Authorization", String("Bearer ") + supabaseApiKey);

  int code = http.GET();
  if (code != 200) {
    http.end();
    client.stop();
    noteNetFail();
    wdtKick();
    return;
  }

  String payload = http.getString();
  http.end();
  client.stop();
  wdtKick();
  noteNetOk();

  StaticJsonDocument<3072> doc;
  if (deserializeJson(doc, payload)) return;
  JsonArray commands = doc["commands"].as<JsonArray>();
  if (commands.isNull() || commands.size() == 0) return;

  // Só 1 comando por ciclo — cascata de TLS travava o ESP (offline + liberação morta).
  processCommand(commands[0].as<JsonObject>());
}

bool initDfPlayer() {
  dfSerial.begin(9600, SERIAL_8N1, 17, 16);
  delay(400);
  // Sem ACK: se o DFPlayer não responder, não bloqueia o boot/rede.
  if (!dfPlayer.begin(dfSerial, false, true)) {
    return false;
  }
  delay(200);
  dfPlayer.volume(28);
  dfPlayer.EQ(DFPLAYER_EQ_NORMAL);
  dfPlayer.outputDevice(DFPLAYER_DEVICE_SD);
  return true;
}

void setupDeviceHttpRoutes() {
  esp32HttpServer().on("/", HTTP_GET, []() {
    esp32HttpServer().send(200, "text/html",
      "<h1>Poltrona</h1><p>" + statusAtual + "</p><p>" + String(ESP32_ID) + "</p>");
  });
  esp32HttpServer().on("/status", HTTP_GET, []() {
    StaticJsonDocument<512> doc;
    doc["status"] = statusAtual;
    doc["tempo_restante_segundos"] = tempoRestanteSeg;
    doc["esp32_id"] = ESP32_ID;
    doc["firmware_version"] = FIRMWARE_VERSION;
    doc["device_profile"] = "timed_session";
    doc["ip"] = WiFi.localIP().toString();
    doc["rssi"] = WiFi.RSSI();
    doc["uptime_seconds"] = millis() / 1000UL;
    doc["last_reset_reason"] = lastResetReason;
    doc["net_fail_count"] = netFailCount;
    String out; serializeJson(doc, out);
    esp32HttpServer().sendHeader("Access-Control-Allow-Origin", "*");
    esp32HttpServer().send(200, "application/json", out);
  });
  esp32HttpServer().on("/stop", HTTP_POST, []() {
    pararPoltrona(true);
    sendHeartbeat();
    esp32HttpServer().send(200, "application/json", "{\"success\":true}");
  });
  esp32HttpServer().onNotFound([]() {
    esp32HttpServer().send(404, "application/json", "{\"error\":\"not found\"}");
  });
}

static bool poltronaOtaBusyHook() {
  return statusAtual == "em_uso" || coolPhase != COOL_IDLE;
}

void handleNetWatchdog() {
  unsigned long now = millis();
  const bool sessionBusy = (statusAtual == "em_uso" || coolPhase != COOL_IDLE);

  // Durante a massagem: NÃO reinicia e NÃO faz WiFi.disconnect — GPIO26 glitcha e o motor “pisca”.
  if (sessionBusy) {
    if (WiFi.status() != WL_CONNECTED) {
      if (wifiDownSinceMs == 0) wifiDownSinceMs = now;
      // Só tenta reconnect suave; sem disconnect forçado.
      if ((now - wifiDownSinceMs) >= 15000UL) {
        WiFi.reconnect();
        wifiDownSinceMs = now;
      }
    } else {
      wifiDownSinceMs = 0;
    }
    return;
  }

  // 1) Sem HTTPS bem-sucedido por tempo demais (Wi‑Fi pode parecer "conectado" e TLS estar morto).
  if (lastNetOkMs == 0) {
    if (now > NET_STALE_RESTART_MS) {
      Serial.println("Sem heartbeat desde o boot — reiniciando");
      delay(150);
      ESP.restart();
    }
  } else if ((now - lastNetOkMs) >= NET_STALE_RESTART_MS) {
    Serial.println("Sem HTTPS OK por 3 min — reiniciando");
    delay(150);
    ESP.restart();
  }

  // 2) Wi‑Fi caído por tempo demais (antes só reconectava e nunca reiniciava).
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiDownSinceMs == 0) wifiDownSinceMs = now;
    else if ((now - wifiDownSinceMs) >= NET_STALE_RESTART_MS) {
      Serial.println("Wi-Fi down 3 min — reiniciando");
      delay(150);
      ESP.restart();
    }
  } else {
    wifiDownSinceMs = 0;
  }

  // 3) Falhas HTTPS consecutivas: força reconexão e, se persistir, reinicia.
  if (netFailCount >= NET_FAIL_RESTART) {
    Serial.println("Rede irrecuperável — reiniciando ESP");
    delay(150);
    ESP.restart();
  }
  if (netFailCount >= NET_FAIL_RECONNECT && WiFi.status() == WL_CONNECTED) {
    Serial.println("Reconectando Wi‑Fi após falhas HTTPS");
    WiFi.disconnect(false, false);
    delay(200);
    WiFi.reconnect();
    delay(400);
    // Evita martelar reconnect a cada loop; próxima falha HTTPS sobe o contador.
    netFailCount = NET_FAIL_RECONNECT - 1;
  }
}

void setup() {
  Serial.begin(115200);
  delay(150);

  // Queda de 5V na partida do motor não pode reiniciar o ESP (relé piscaria).
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);

  gpio_hold_dis((gpio_num_t)RELAY_PIN);
  pinMode(RELAY_PIN, OUTPUT);
  relayPinReady = true;
  bool resumeSession = peekPersistedSessionActive();
  relayAppliedLevel = -1;
  acionarRele(resumeSession);

  loadLastExecutedCommandId();
  buildEsp32Id();
  lastResetReason = describeResetReason();

  Serial.println("=================================");
  Serial.printf(" Poltrona %s\n", FIRMWARE_VERSION);
  Serial.printf(" ESP32_ID: %s rst:%s\n", ESP32_ID, lastResetReason);
  Serial.println("=================================");

  setupWatchdog();

  if (resumeSession) restorePersistedSession();
  else { clearPersistedSession(); acionarRele(false); }

  esp32SetOtaBusyHook(poltronaOtaBusyHook);
  esp32WifiOtaRegisterPortalRoutes();
  setupDeviceHttpRoutes();
  esp32WifiOtaBegin();
  WiFi.setSleep(false); // sleep do Wi‑Fi glitcha GPIO ADC2 (relé no 26)

  // Não forçar lastNetOkMs aqui: se o 1º HB falhar, o watchdog de 3 min reinicia.
  sendHeartbeat();
  lastHeartbeat = millis();
  lastPoll = millis();
  wdtKick();

  dfplayerDisponivel = initDfPlayer();
  Serial.printf("DFPlayer: %s\n", dfplayerDisponivel ? "OK" : "off");
  reassertRelayIfSession();
  wdtKick();
}

void loop() {
  wdtKick();

  const bool wifiOk = esp32WifiOtaMaintain();
  gerenciarAudios();
  atualizarTimerSessao();
  atualizarResfriamento();
  reassertRelayIfSession();
  handleNetWatchdog();

  if (!wifiOk) {
    delay(40);
    return;
  }

  // Após ligar o motor: adia HTTPS (tensão + ADC2) — evita piscar o relé.
  if (inSessionNetQuiet()) {
    delay(40);
    return;
  }

  unsigned long now = millis();
  // Alterna HB e poll; em falha de HB tenta de novo em 5s (não espera 25s).
  if (now - lastHeartbeat >= HEARTBEAT_INTERVAL_MS) {
    bool ok = sendHeartbeat();
    lastHeartbeat = ok ? now : (now - HEARTBEAT_INTERVAL_MS + HEARTBEAT_RETRY_MS);
    reassertRelayIfSession();
  } else if (now - lastPoll >= POLL_INTERVAL_MS) {
    pollCommands();
    lastPoll = now;
    reassertRelayIfSession();
  }

  delay(40);
}
